### This file from python for data analysis

In [1]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [2]:
frame_2 = pd.DataFrame(data, columns=['year', 'state', 'pop'])
frame_2

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [22]:
frame_3 = pd.DataFrame(data, columns=['years', 'state', 'pop', 'debt'], index=['one', 'two', 'three', 'four', 'five'])
frame_3

      years   state  pop debt
one     NaN    Ohio  1.5  NaN
two     NaN    Ohio  1.7  NaN
three   NaN    Ohio  3.6  NaN
four    NaN  Nevada  2.4  NaN
five    NaN  Nevada  2.9  NaN

In [23]:
frame_3.columns

Index(['years', 'state', 'pop', 'debt'], dtype='object')

In [24]:
frame_3.years

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: years, dtype: object

	One of the fonts you requested is not available
	Setting all fonts to default
Traceback (most recent call last):
  File "/home/dabve/.local/bin/jt", line 8, in <module>
    sys.exit(main())
  File "/home/dabve/.local/lib/python3.8/site-packages/jupyterthemes/__init__.py", line 290, in main
    install_theme(
  File "/home/dabve/.local/lib/python3.8/site-packages/jupyterthemes/__init__.py", line 69, in install_theme
    style_less = stylefx.set_font_properties(
  File "/home/dabve/.local/lib/python3.8/site-packages/jupyterthemes/stylefx.py", line 142, in set_font_properties
    monofont, monofpath = stored_font_dicts(monofont)
ValueError: not enough values to unpack (expected 2, got 0)

In [25]:
frame_3['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [27]:
# column can be modified by assignement
frame_3['debt'] = 16.5
frame_3

      years   state  pop  debt
one     NaN    Ohio  1.5  16.5
two     NaN    Ohio  1.7  16.5
three   NaN    Ohio  3.6  16.5
four    NaN  Nevada  2.4  16.5
five    NaN  Nevada  2.9  16.5

In [36]:
# dataframe with nested dicts
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame_4 = pd.DataFrame(pop)
frame_4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [37]:
# transpose the result
frame_4.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5